<h2>01. Pengenalan Statistika</h2>
<ul>
  <li>Definisi Statistika -> Ilmu yang mempelajari cara <strong>pengumpulan data</strong>, <strong>menganalisis data</strong> untuk mendapatkan kesimpulan informasi sampai dapat dijadikan <strong>pembuatan keputusan atau kebijakan</strong></li>
  <p><strong>Kesimpulan</strong></p>
  <ol>
    <li>Bagaimana cara mengumpulkan data</li>
    <li>Bagaimana cara menganalisa data</li>
  </ol>
  <p><strong>Statistika Deskriptif</strong></p>
  <ol>
    <li>Bagaimana cara mengorganisir data</li>
    <li>Bagaimana cara membuat kesimpulan dari data</li>
  </ol>
  <p><strong>Cara Menyimpulkan Data</strong></p>
  <ol>
    <li>Membuat <strong>Grafik</strong></li>
    <li>Menggunakan <strong>Angka</strong> seperti nilai <strong>mean</strong> data</li>
  </ol>
  <p><strong>Statistika Inferensial</strong></p>
  <ol>
    <li>Mengambil keputusan dari data yang sudah di olah</li>
  </ol>
</ul>

<h2>02. Beberapa Konsep Dasar Statistika</h2>
<h3>Populasi - Sampel - Observasi/Pengamatan</h3>
<ol>
  <li><strong>Observasi</strong> -> Suatu unit yang diukur dengan data</li>
  <ul>
    <li>Siswa</li>
    <li>Warga Negara</li>
    <li>Hewan</li>
    <li>Kendaraan</li>
  </ul>
  <li><strong>Populasi</strong> -> Koleksi dari keseluruhan Observasi</li>
  <ul>
    <li>Semua siswa yang ada di sekolah</li>
    <li>Semua warga negara Indonesia</li>
    <li>Semua hewan yang ada di hutan lindung</li>
    <li>Semua kendaraan di Jakarta</li>
  </ul>
  <li><strong>Sampel</strong> -> Sub koleksi dari populasi</li>
  <ul>
    <li>5 siswa dari masing - masing kelas di suatu sekolah</li>
    <li>100 warga negara Indonesia yang diambil dari beberapa wilayah</li>
    <li>Beberapa spesies hewan tertentu di suatu hutan lindung</li>
    <li>3 jenis kendaraan di Jakarta</li>
  </ul>
</ol>

<h2>03. Statistika & Parameter</h2>
<ol>
  <li><strong>Parameter</strong> -> Penjelasan atas populasi</li>
    <ul>
      <li>Mengukur revenue dari setiap orang di dalam segmen</li>
    </ul>
  <li><strong>Statistika</strong> -> Menjelaskan sampel dari populasi</li>
    <ul>
      <li>Mengambil 20% orang dari setiap segmen</li>
    </ul>
</ol>

<h2>04. Data Kualitatif & Data Kuantitatif</h2>
<ol>
  <h4><strong>Data Kualitatif</strong></h4>
  <ul>
    <li><strong>Definisi</strong> : Data yang diperoleh dari mengkategorikan atau menjelaskan suatu atribut dari populasi atau sampel</li>
    <li>Data Kualitatif = Data Kategorik</li>
    <ul>
      <strong>Contoh Data Kualitatif</strong>
      <li>Warna Rambut</li>
      <li>Golongan Darah</li>
      <li>Nama Jalan</li>
      <li>Nama Produk</li>
    </ul>
  </ul>
  <h4><strong>Data Kuantitatif</strong></h4>
  <ul>
    <li><strong>Definisi</strong> : Data yang diperoleh dari ukuran atau hitungan suatu atribut dari populasi atau sampel</li>
    <li><strong>Data Kuantitatif</strong></li>
    <ol>
      <li><strong>Data Diskrit</strong></li>
      <ul>
        <li>Definisi -> Data yang diperoleh dari hasil perhitungan</li>
        <li><strong>Contoh Data Diskrit</strong></li>
        <ul>
          <li>Jumlah Pelanggan</li>
          <li>Jumlah Produk</li>
          <li>Jumlah Telepom yang diterima oleh Customer</li>
        </ul>
      </ul>
      <li><strong>Data Kontinyu</strong></li>
      <ul>
        <li>Definisi -> Data yang diperoleh dari hasil perhitungan namun dapat memuat rasio, desima, atau bilangan irasional</li>
        <li><strong>Contoh Data Kontinyu</strong></li>
        <ul>
          <li>Tinggi Badan</li>
          <li>Berat Badan</li>
          <li>Waktu</li>
          <li>Gaji</li>
        </ul>      
      </ul>
    </ol>
  </ul>
</ol>

<h2>05. Tipe Statistika</h2>
<ol>
  <li><strong>Statistika Deskriptif</strong></li>
  <ul>
    <li>Definisi -> Digunakan untuk melakukan eksplorasi data, biasanya menggunakan teknik visualisasi data sebagai alat bantu untuk memahami bagaimana bentuk distribusi dan hubungan antara satu titik data dengan titik data lainnya</li>
    <li><strong>Melakukan Eksplorasi Data</strong></li>
    <li><strong>Teknik Visualisasi Data</strong></li>
  </ul>
  <li><strong>Statistika Inferensial</strong></li>
  <ul>
    <li>Definisi -> Digunakan untuk melakukan pengambilan keputusan atas suatu simpulan terkait dengan data yang sedang dianalisa. Statistika inferensi memungkinkan kita mengambil kesimpulan dari suatu populasi dengan menggunakan sampel yang diambil dari populasi tersebut</li>
    <li><strong>Pengambilan Keputusan Atas Suatu Populasi dengan Menggunakan Sampel</strong></li>
  </ul>
</ol>

<h2>06. Skala Pengukuran - Data Kategorikal</h2>
<ol>
  <li><strong>Skala Nominal</strong></li>
  <ul>
    <li>Definisi -> Skala yang digunakan untuk <strong>mengkategorikan</strong> suatu objek pengamatan dengan pengamatan lainnya</li>
    <li>Contoh Skala Nominal</li>
    <ul>
      <li>Gender</li>
      <li>Kategori Barang</li>
      <li>Domisili</li>
      <li>Menu Makanan</li>
    </ul>
  </ul>
  <li><strong>Skala Ordinal</strong></li>
  <ul>
    <li>Definisi Skala yang digunakan untuk <strong>mengurutkan</strong> suatu objek pengamatan dimana suatu titik pengamatan memiliki nilai yang lebih rendah atau tinggi dibanding nilai lainnya</li>
    <li>Contoh Skala Ordinal</li>
    <ul>
      <li>Ukuran Baju</li>
      <li>Tingkat Pendidikan</li>
      <li>Jabatan</li>
      <li>Rating Tempat Makan</li>
    </ul>
  </ul>
</ol>

<h2>07. Skala Pengukuran - Data Numerikal</h2>
<h3><strong>Perbedaan Utama</strong></h3>
<table border="1" style="border-collapse: collapse; width: 100%;">
  <thead>
    <tr>
      <th style="text-align: left;">Aspek</th>
      <th style="text-align: left;">Skala Interval</th>
      <th style="text-align: left;">Skala Rasio</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="text-align: left;">Nol Absolut</td>
      <td style="text-align: left;">Tidak ada (nol arbitrer)</td>
      <td style="text-align: left;">Ada (nol menunjukkan ketiadaan)</td>
    </tr>
    <tr>
      <td style="text-align: left;">Operasi Matematika</td>
      <td style="text-align: left;">Penjumlahan, pengurangan valid</td>
      <td style="text-align: left;">Semua operasi matematika valid</td>
    </tr>
    <tr>
      <td style="text-align: left;">Contoh</td>
      <td style="text-align: left;">Suhu Celsius, tahun</td>
      <td style="text-align: left;">Berat, panjang, waktu, suhu Kelvin</td>
    </tr>
  </tbody>
</table>
<h4>Jadi perbedaan kunci antara skala interval dan rasio terletak pada <strong>keberadaan nol absolut</strong> dan validitas operasi matematika seperti perbandingan rasio</h4>

<h2>08. Package Statistika di Python</h2>
<table border="1" style="border-collapse: collapse; width: 100%;">
  <thead>
    <tr>
      <th style="text-align: left;">Library</th>
      <th style="text-align: left;">Deskripsi</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="text-align: left;">numpy</td>
      <td style="text-align: left;">Digunakan untuk melakukan analisa data numerik dan perhitungan berbasis vektor atau matriks</td>
    </tr>
    <tr>
      <td style="text-align: left;">pandas</td>
      <td style="text-align: left;">Digunakan untuk melakukan pengolahan data tabular</td>
    </tr>
    <tr>
      <td style="text-align: left;">matplotlib</td>
      <td style="text-align: left;">Digunakan untuk melakukan plotting atau penggambaran grafik, dapat digunakan sebagai alat bantu dalam analisa data</td>
    </tr>
    <tr>
      <td style="text-align: left;">statsmodels</td>
      <td style="text-align: left;">Digunakan untuk melakukan uji hipotesa, eksplorasi data maupun pemodelan statistika</td>
    </tr>
    <tr>
      <td style="text-align: left;">scipy</td>
      <td style="text-align: left;">Digunakan untuk uji statistika, juga dapat digunakan untuk melakukan pemodelan statistika</td>
    </tr>
  </tbody>
</table>

<h2>09. Pengenalan Numpy dan Pandas</h2>
<table border="1" style="border-collapse: collapse; width: 100%;">
  <thead>
    <tr>
      <th style="text-align: left;">Library</th>
      <th style="text-align: left;">Deskripsi</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="text-align: left;">numpy</td>
      <td style="text-align: left;">
        Digunakan untuk manipulasi array atau vektor, termasuk operasi berbasis matriks dan multidimensi (misalnya data gambar dengan skema warna RGB).
      </td>
    </tr>
    <tr>
      <td style="text-align: left;">pandas</td>
      <td style="text-align: left;">
        Digunakan untuk analisis data tabular (data wrangling), seperti membaca data dari format <code>csv</code>, <code>xlsx</code>, dan lainnya, serta transformasi nilai, encoding, dan normalisasi. Pandas menggunakan numpy sebagai back-end.
      </td>
    </tr>
  </tbody>
</table>

<h2>10. Load Library</h2>

In [1]:
# memuat numpy sebagai np
import numpy as np
# memuat pandas sebagai pd
import pandas as pd

<h2>11. Load Dataset</h2>

In [2]:
# memuat data bernama 'dataset_statistics.csv' dan memasukannya ke dalam 'raw_data'
raw_data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/dataset_statistic.csv", sep=';')

<h2>12. Inspeksi Data</h2>

In [3]:
# Melihat 10 data pada baris pertama
print(f"10 data pada baris pertama:")
display(raw_data.head(10))

# Melihat 5 data pada baris terakhir
print(f"5 data pada baris terakhir:")
display(raw_data.tail(5))

10 data pada baris pertama:

,ID Pelanggan,Nama,Jenis Kelamin,Pendapatan,Produk,Harga,Jumlah,Total,Tingkat Kepuasan
0,1,Arif,1,600000,A,100000,4,400000,2
1,2,Dian,2,1200000,D,250000,4,1000000,2
2,3,Dinda,2,950000,D,250000,3,750000,3
3,4,Fajar,1,400000,A,100000,2,200000,3
4,5,Ika,2,1200000,D,250000,4,1000000,2
5,6,Ilham,1,800000,B,150000,4,600000,3
6,7,Indra,1,950000,B,150000,5,750000,1
7,8,Kartika,2,1100000,E,300000,3,900000,3
8,9,Lestari,2,800000,E,300000,2,600000,1
9,10,Lia,2,1700000,E,300000,5,1500000,1

5 data pada baris terakhir:

,ID Pelanggan,Nama,Jenis Kelamin,Pendapatan,Produk,Harga,Jumlah,Total,Tingkat Kepuasan
15,16,Rini,2,800000,B,150000,4,600000,1
16,17,Rizki,1,1200000,C,200000,5,1000000,3
17,18,Sari,2,700000,D,250000,2,500000,1
18,19,Tyas,2,600000,A,100000,4,400000,3
19,20,Wahyu,1,800000,C,200000,3,600000,1

<h2>13. Metode Shape</h2>
<h3>Pertanyaan ? <strong>Berapa banyak baris data dan fitur yang dataset punya ?</strong></h3>

In [4]:
# melihat dimensi dari raw_data
print(f"Dimensi dari raw_data:")
print(f"raw data terdiri dari {raw_data.shape[0]} baris dan {raw_data.shape[1]} kolom")

# mengambil jumlah data
print(f"Jumlah data:")
print(f"Jumlah data adalah {raw_data.shape[0]}")

Dimensi dari raw_data:
raw data terdiri dari 20 baris dan 9 kolom
Jumlah data:
Jumlah data adalah 20

<h2>14. Melihat Kolom Dataset</h2>
<h4>Pertanyaan ? <strong><code>Kolom</code> apa saja yang terdapat dalam dataset <code>?</code></strong></h4>

In [5]:
# menampilkan nama kolom dataset
print(f"raw data terdiri darni {raw_data.shape[1]} kolom")
print(f"\nnama-nama kolom pada dataset: ")
print(raw_data.columns.to_list())

raw data terdiri darni 9 kolom

nama-nama kolom pada dataset:
['ID Pelanggan', 'Nama', 'Jenis Kelamin', 'Pendapatan', 'Produk', 'Harga', 'Jumlah ', 'Total', 'Tingkat Kepuasan']

<h2>15. Metode Isna</h2>
<h4>Pertanyaan ? Ada berapa banyak data yang <code>hilang</code> dalam dataset <code>?</code></h4>

In [6]:
# menampilkan dataset yang hilang
print(f"menampilkan dataset yang hilang: ")
display(raw_data.isna())

# menampilkan total dataset yang hilang
print(f"menampilkan total dataset yang hilang: ")
print(raw_data.isna().sum())

menampilkan dataset yang hilang:

,ID Pelanggan,Nama,Jenis Kelamin,Pendapatan,Produk,Harga,Jumlah,Total,Tingkat Kepuasan
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False,False
10,False,False,False,False,False,False,False,False,False
11,False,False,False,False,False,False,False,False,False
12,False,False,False,False,False,False,False,False,False
13,False,False,False,False,False,False,False,False,False
14,False,False,False,False,False,False,False,False,False
15,False,False,False,False,False,False,False,False,False
16,False,False,False,False,False,False,False,False,False
17,False,False,False,False,False,False,False,False,False
18,False,False,False,False,False,False,False,False,False
19,False,False,False,False,False,False,False,False,False

menampilkan total dataset yang hilang:
ID Pelanggan        0
Nama                0
Jenis Kelamin       0
Pendapatan          0
Produk              0
Harga               0
Jumlah              0
Total               0
Tingkat Kepuasan    0
dtype: int64

<h2>16. Metode Describe</h2>
<h4>Pertanyaan ? bagaimana ringkasan <code>statistika deskriptif</code> dataset <code>?</code></h4>

In [7]:
# menampilkan statistika deskriptif dataset
print(f"menampilkan statistika deskriptif dataset: ")
display(raw_data.describe().round())

# mencari nilai maksimum dari tiap kolom
print(f"\nmenampilkan nilai maksimum dari tiap kolom: ")
print(raw_data.max())

# mencari nilai maksimum kolom harga
print(f"\nmenampilkan nilai maksimum kolom harga: ")
print(raw_data["Harga"].max())

# mencari nilai minimum dari kolom harga
print(f"\nmenampilkan nilai minimum kolom harga: ")
print(raw_data["Harga"].min())

menampilkan statistika deskriptif dataset:

,ID Pelanggan,Jenis Kelamin,Pendapatan,Harga,Jumlah,Total,Tingkat Kepuasan
count,20.0,20.0,20.0,20.0,20.0,20.0,20.0
mean,10.0,2.0,1160000.0,197500.0,4.0,710000.0,2.0
std,6.0,0.0,1282842.0,69727.0,1.0,333877.0,1.0
min,1.0,1.0,400000.0,100000.0,1.0,200000.0,1.0
25%,6.0,1.0,675000.0,150000.0,3.0,475000.0,1.0
50%,10.0,2.0,875000.0,200000.0,4.0,675000.0,2.0
75%,15.0,2.0,1125000.0,250000.0,4.0,925000.0,3.0
max,20.0,2.0,6450000.0,300000.0,5.0,1500000.0,3.0

menampilkan nilai maksimum dari tiap kolom:
ID Pelanggan             20
Nama                  Wahyu
Jenis Kelamin             2
Pendapatan          6450000
Produk                    E
Harga                300000
Jumlah                    5
Total               1500000
Tingkat Kepuasan          3
dtype: object

menampilkan nilai maksimum kolom harga:
300000

menampilkan nilai minimum kolom harga:
100000

<h2>17. Metode Sum</h2>

In [10]:
# menghitung jumlah dari semua baris
print(f"Menampilkan jumlah dari semua baris: ")
print(raw_data.sum())

# menghitung jumlah dari semua kolom bertipe data numerik saja
print(f"\nMenampilkan jumlah dari semua kolom bertipe data numerik saja")
print(raw_data.sum(numeric_only=True))

# mengitung jumlah dari kolom "Harga" dan "Pendapatan"
print(f"\nMenampilkan jumlah dari  kolom Harga dan Pendapatan")
print(raw_data[["Harga","Pendapatan"]].sum())

Menampilkan jumlah dari semua baris:
ID Pelanggan                                                      210
Nama                ArifDianDindaFajarIkaIlhamIndraKartikaLestariL...
Jenis Kelamin                                                      34
Pendapatan                                                   23200000
Produk                                           ADDADBBEEEABCDCBCDAC
Harga                                                         3950000
Jumlah                                                             73
Total                                                        14200000
Tingkat Kepuasan                                                   41
dtype: object

Menampilkan jumlah dari semua kolom bertipe data numerik saja
ID Pelanggan             210
Jenis Kelamin             34
Pendapatan          23200000
Harga                3950000
Jumlah                    73
Total               14200000
Tingkat Kepuasan          41
dtype: int64

Menampilkan jumlah dari  kolom Harga dan Pendapatan
Harga          3950000
Pendapatan    23200000
dtype: int64

<h2>18. Manipulasi Dataframe Memilih Kolom dan Baris</h2>

In [14]:
# memilih kolom "Pendapatan" saja
print(f"Menampilkan kolom Pendapatan saja: ")
display(raw_data[["Pendapatan"]].head())

# memilih kolom "Jenis Kelamin" dan "Pendapatan"
print(f"Menampilkan kolom Jenis Kelamin dan Pendapatan")
display(raw_data[["Jenis Kelamin","Pendapatan"]].head())

Menampilkan kolom Pendapatan saja:

   Pendapatan
0      600000
1     1200000
2      950000
3      400000
4     1200000

Menampilkan kolom Jenis Kelamin dan Pendapatan

   Jenis Kelamin  Pendapatan
0              1      600000
1              2     1200000
2              2      950000
3              1      400000
4              2     1200000

<h2>19. Metode Loc</h2>

In [26]:
# Mengambil baris pertama (index - 0) sampai baris ke - 9 (index - 9) yaitu sebanyak 10 baris
print(f"Menampilkan baris index - 0 sampai index - 9 (1o baris)")
display(raw_data[:10])

# Mengambil data dari baris ke 4 (index - 3) hingga baris ke 5 (index - 4)
print(f"\nMenampilkan baris index - 3 sampai index - 4")
display(raw_data[3:5])

# Mengambil data dari baris ke 2 (index - 1), baris ke 4 (index - 3), dan baris ke 11 (index - 10)
print(f"\nMenampilkan baris index 1 - index 3 - index 10")
display(raw_data.loc[[1, 3, 10]])

# Mengambil kolom 'Jenis Kelamin' dan 'Pendapatan' dari baris ke 2 (index 1) hingga baris ke 10 (index 9)
print(f"\nMenampilkan kolom Jenis Kelamin dan Pendapatan dari index 1 hingga index 9: ")
display(raw_data[["Jenis Kelamin","Pendapatan"]].loc[1:10])
display(raw_data[["Jenis Kelamin","Pendapatan"]][1:10])

# Mengambil kolom Harga dan Tingkat Kepuasan dari baris ke 2 (index 1) baris ke 11 (index 10) dan baris ke 16 (index 15)
print(f"\nMenampilkan Kolom Harga dan Tingkat Kepuasan baris index 1 - index 10 - index 15")
display(raw_data[["Harga","Tingkat Kepuasan"]].loc[[1, 10, 15]])

Menampilkan baris index - 0 sampai index - 9 (1o baris)

,ID Pelanggan,Nama,Jenis Kelamin,Pendapatan,Produk,Harga,Jumlah,Total,Tingkat Kepuasan
0,1,Arif,1,600000,A,100000,4,400000,2
1,2,Dian,2,1200000,D,250000,4,1000000,2
2,3,Dinda,2,950000,D,250000,3,750000,3
3,4,Fajar,1,400000,A,100000,2,200000,3
4,5,Ika,2,1200000,D,250000,4,1000000,2
5,6,Ilham,1,800000,B,150000,4,600000,3
6,7,Indra,1,950000,B,150000,5,750000,1
7,8,Kartika,2,1100000,E,300000,3,900000,3
8,9,Lestari,2,800000,E,300000,2,600000,1
9,10,Lia,2,1700000,E,300000,5,1500000,1

Menampilkan baris index - 3 sampai index - 4

,ID Pelanggan,Nama,Jenis Kelamin,Pendapatan,Produk,Harga,Jumlah,Total,Tingkat Kepuasan
3,4,Fajar,1,400000,A,100000,2,200000,3
4,5,Ika,2,1200000,D,250000,4,1000000,2

Menampilkan baris index 1 - index 3 - index 10

,ID Pelanggan,Nama,Jenis Kelamin,Pendapatan,Produk,Harga,Jumlah,Total,Tingkat Kepuasan
1,2,Dian,2,1200000,D,250000,4,1000000,2
3,4,Fajar,1,400000,A,100000,2,200000,3
10,11,Maria,2,600000,A,100000,4,400000,3

Menampilkan kolom Jenis Kelamin dan Pendapatan dari index 1 hingga index 9:

    Jenis Kelamin  Pendapatan
1               2     1200000
2               2      950000
3               1      400000
4               2     1200000
5               1      800000
6               1      950000
7               2     1100000
8               2      800000
9               2     1700000
10              2      600000

   Jenis Kelamin  Pendapatan
1              2     1200000
2              2      950000
3              1      400000
4              2     1200000
5              1      800000
6              1      950000
7              2     1100000
8              2      800000
9              2     1700000

Menampilkan Kolom Harga dan Tingkat Kepuasan baris index 1 - index 10 - index 15

     Harga  Tingkat Kepuasan
1   250000                 2
10  100000                 3
15  150000                 1